In [6]:
# import the pandas library
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f',
'h'],columns=['one', 'two', 'three'])

df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

print( df)
print (df['one'].isnull())
print (df['one'].notnull())
print (df['one'].isnull().sum())

        one       two     three
a -1.400026  0.499187 -1.637133
b       NaN       NaN       NaN
c -0.946574  0.247199  1.079604
d       NaN       NaN       NaN
e  0.873749  0.126714 -1.933195
f -0.554106  0.974054 -0.282397
g       NaN       NaN       NaN
h -0.521322  1.060566 -0.144102
a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool
a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool
3

In [9]:
df.dtypes

one      float64
two      float64
three    float64
dtype: object

In [4]:
print ("NaN replaced with '0':")
print( df.fillna(0))

NaN replaced with '0':
        one       two     three
a  1.239184 -1.454827 -0.286104
b  0.000000  0.000000  0.000000
c -0.779438  0.411418  0.746480
d  0.000000  0.000000  0.000000
e -1.799040  1.350684 -0.282046
f -0.590477  0.603035  0.254525
g  0.000000  0.000000  0.000000
h  0.048683  1.159679 -1.306797

In [12]:
print(df["one"].fillna(method="pad"))

a   -1.400026
b   -1.400026
c   -0.946574
d   -0.946574
e    0.873749
f   -0.554106
g   -0.554106
h   -0.521322
Name: one, dtype: float64

In [2]:
df.describe()

            one       two     three
count  5.000000  5.000000  5.000000
mean   0.082557 -0.599413  0.378603
std    1.209313  1.571869  0.946576
min   -1.351039 -2.936710 -0.924486
25%   -0.577442 -1.449003 -0.021693
50%   -0.100643  0.054286  0.242873
75%    0.615359  0.490429  1.208304
max    1.826550  0.843934  1.388017

In [5]:
print(df)
print( df.fillna(method='pad'))

        one       two     three
a  1.239184 -1.454827 -0.286104
b       NaN       NaN       NaN
c -0.779438  0.411418  0.746480
d       NaN       NaN       NaN
e -1.799040  1.350684 -0.282046
f -0.590477  0.603035  0.254525
g       NaN       NaN       NaN
h  0.048683  1.159679 -1.306797
        one       two     three
a  1.239184 -1.454827 -0.286104
b  1.239184 -1.454827 -0.286104
c -0.779438  0.411418  0.746480
d -0.779438  0.411418  0.746480
e -1.799040  1.350684 -0.282046
f -0.590477  0.603035  0.254525
g -0.590477  0.603035  0.254525
h  0.048683  1.159679 -1.306797

In [6]:
print(df)
print( df.fillna(method='bfill'))

        one       two     three
a  1.239184 -1.454827 -0.286104
b       NaN       NaN       NaN
c -0.779438  0.411418  0.746480
d       NaN       NaN       NaN
e -1.799040  1.350684 -0.282046
f -0.590477  0.603035  0.254525
g       NaN       NaN       NaN
h  0.048683  1.159679 -1.306797
        one       two     three
a  1.239184 -1.454827 -0.286104
b -0.779438  0.411418  0.746480
c -0.779438  0.411418  0.746480
d -1.799040  1.350684 -0.282046
e -1.799040  1.350684 -0.282046
f -0.590477  0.603035  0.254525
g  0.048683  1.159679 -1.306797
h  0.048683  1.159679 -1.306797

In [7]:
print(df)
print( df.dropna())

        one       two     three
a  1.239184 -1.454827 -0.286104
b       NaN       NaN       NaN
c -0.779438  0.411418  0.746480
d       NaN       NaN       NaN
e -1.799040  1.350684 -0.282046
f -0.590477  0.603035  0.254525
g       NaN       NaN       NaN
h  0.048683  1.159679 -1.306797
        one       two     three
a  1.239184 -1.454827 -0.286104
c -0.779438  0.411418  0.746480
e -1.799040  1.350684 -0.282046
f -0.590477  0.603035  0.254525
h  0.048683  1.159679 -1.306797

In [8]:
#Interpolation of immediate data before and after it (average is taken)

print(df.interpolate())

        one       two     three
a  1.239184 -1.454827 -0.286104
b  0.229873 -0.521705  0.230188
c -0.779438  0.411418  0.746480
d -1.289239  0.881051  0.232217
e -1.799040  1.350684 -0.282046
f -0.590477  0.603035  0.254525
g -0.270897  0.881357 -0.526136
h  0.048683  1.159679 -1.306797

In [14]:
df=pd.read_csv("train.csv")

In [15]:
drop=['Gender','Married']
df.drop(drop,inplace=True,axis=1)#columns Gender and married are dropped

In [16]:
df.head()

,Loan_ID,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y